BAS BMEKZU Project/src/Reports/ИНАГРО_ДанныеПоКачествуЗерна/ИНАГРО_ДанныеПоКачествуЗерна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИНАГРО_ДанныеПоКачествуЗерна</name>
  <attributes>
    <name>НачальныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереключательКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьНеВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесьВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесьНеВыше</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоВлажностиВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоВлажностиНеВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоСорнойПримесиВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОтбораПоСорнойПримесиНеВыше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сушить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Чистить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

BAS BMEKZU Project/src/Reports/ИНАГРО_ДанныеПоКачествуЗерна/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ПереключательКачества = 1;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитов

&НаКлиенте
Процедура ВлажностьВышеПриИзменении(Элемент)
	Если Отчет.ВлажностьВыше Тогда
		Отчет.ВлажностьНеВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаКлиенте
Процедура СорнаяПримесьНеВышеПриИзменении(Элемент)
	Если Отчет.СорнаяПримесьНеВыше Тогда
		Отчет.СорнаяПримесьВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаКлиенте
Процедура СорнаяПримесьВышеПриИзменении(Элемент)
	Если Отчет.СорнаяПримесьВыше Тогда
		Отчет.СорнаяПримесьНеВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаКлиенте
Процедура ВлажностьНеВышеПриИзменении(Элемент)
	Если Отчет.ВлажностьНеВыше Тогда
		Отчет.ВлажностьВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Не Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЗначенийОтборов()
	Элементы.ЗначениеОтбораПоВлажностиВыше.Доступность = Отчет.ВлажностьВыше;
	Элементы.ЗначениеОтбораПоВлажностиНеВыше.Доступность = Отчет.ВлажностьНеВыше;
	
	Элементы.ЗначениеОтбораПоСорнойПримесиВыше.Доступность = Отчет.СорнаяПримесьВыше;
	Элементы.ЗначениеОтбораПоСорнойПримесиНеВыше.Доступность = Отчет.СорнаяПримесьНеВыше;
КонецПроцедуры

#КонецОбласти
